Revit 2026 API

# SaveOptionsPreviewViewId Property

---

The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId PreviewViewId { get; set; }
```
```vb
Public Property PreviewViewId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ PreviewViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member PreviewViewId : ElementId with get, set
```

#### Property Value

ElementId The id must be valid for use as a preview view (check DocumentPreviewSettings.IsViewIdValidForPreview()). Revit does not check validity when setting this value, only when the options are used in a call to SaveAs().

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

If this id is set, the indicated view will be used to generate the preview even if DocumentPreviewSettings.PreviewViewId is also set.

#### Reference

SaveOptions Class

Autodesk.Revit.DB Namespace